#****************************************************************#
# |============================================================| #
# |HYPRLOCK — экран блокировки для Niri                        | #
# |============================================================| #
#  Конфиг: .dotfiles/.config/hypr/hyprlock.conf               #
#  Линкуется через home-xdg/config-files.nix                  #
#  PAM настроен в system/core/security.nix                    #
#****************************************************************#
{ ... }: {

  programs.hyprlock.enable = true;

}
