  #****************************************************************#
  # |============================================================| #
  # |SOCIAL-APPS                                                 | #
  # |============================================================| #
  #****************************************************************#
{ pkgs, ... }: {
  environment.systemPackages = with pkgs; [
    # ── Видео ────────────────────────────────────
    mpv               # основной плеер
    # vlc               # резерв
    zoom-us

    # ── Аудио ─────────────────────────────────────
    pear-desktop      # YouTube Music
    pavucontrol       # PulseAudio/PipeWire GUI
    easyeffects       # эффекты звука
    amberol

    # ── Загрузка ──────────────────────────────────
    yt-dlp            # скачать видео/аудио с YouTube и др.
    aria2             # мощный мультипротокольный downloader

    # ── Запись/стриминг ───────────────────────────
    obs-studio

    # ── Изображения ───────────────────────────────
    loupe
    # imv               # просмотрщик изображений Wayland
    # ── Местный фотошоп ───────────────────────────────
    gimp

    # ── Торрент ───────────────────────────────────
    qbittorrent
  ];
}
