{ shellColors, config, ... }:
let
  inherit (shellColors) b g y res;
in {
  programs.zsh.interactiveShellInit = ''
    alisa() {
      echo -e "\n${b}╔+╔╔══════════════════════════════════════════════════════════════════════════════╗${res}"║
      echo -e "${b}  ║+╠${res}║+║${y}󱄅${res}  KORI-Icebook — NixOS Handbook                       ║${b}║${res}"║
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"║
      echo -e "${b}  ║+╠${res}║+║${y}alisa_nix-management${res} — Сборка и конфиги системы        ║${b}║${res}"║
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"║
      echo -e "${b}  ║+╠${res}║+║${y}alisa_git${res} — Работа с репозиториями                     ║${b}║${res}"║
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+╠${res}║+║${y}alisa_logs${res} — Системные журналы                         ║${b}║${res}"
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+╠${res}║+║${y}alisa_cli${res} — Навигация и файлы                           ║${b}║${res}"
      echo -e "${b}  ║+╠════════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+╠${res}║+║${y}alisa_system${res} — Железо и мониторинг                       ║${b}║${res}"
      echo -e "${b}  ║+╠════════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+║${res}║+║${y}alisa_network${res}                    ║Сетевые утилиты и IP║  ${b}║${res}"
      echo -e "${b}  ║+╠════════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+║${res}║+║${y}alisa_niri${res}║++++++++++++++++++++++║Окна и скрины (Niri)║++║${b}║${res}"
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+║${res}║+║${y}alisa_hypr${res}++++║+++║+++++++++++++++++║Настройки Hyprland║ ║++║${b}║${res}"
      echo -e "${b}  ║+╠═══════════════════════════════════════════════════════════════════════════════╣${res}"
      echo -e "${b}  ║+║${res}║+║${y}alisa_waydroid${res}║+++║+++++++++++++++++++++++║Android окружение║${b}║${res}"
      echo -e "${b}  ╚+╚═══════════════════════════════════════════════════════════════════════════════╝${res}\n"
    }
  '';
}
