#****************************************************************#

#|============================================================|
#|ENVIRONMENT — дирижёр переменных среды и XDG |
#|============================================================|
#****************************************************************#
{ ... }: {
imports = [
./drivers-rendering.nix # AMD, Wayland, VA-API
./toolkits-styles.nix # Qt/GTK темы
./session-xdg.nix # XDG пути сессии
./apps-fixes.nix # фиксы для Electron/Java
./system-terminal.nix
];
}
