#****************************************************************#
# |============================================================| #
# |BINARY CACHES — дирижёр                                     | #
# |============================================================| #
#  Каждый кеш — отдельный файл: просто добавь новый файл .nix  #
#  и заимпортируй сюда строчкой ниже                           #
#  Формат файла: см. любой существующий как пример             #
#****************************************************************#
{ ... }: {
  imports = [
    ./nixos-cache.nix
    ./niri.nix
    ./nix-community.nix
    ./nix-gaming.nix
    ./yazi.nix
    ./chaotic.nix
    ./fufexan.nix
    ./kori-cachix.nix
    ./helix.nix
    # ./hyprland.nix
    ./noctalia-shell-cache.nix
    ./ayugram-desktop.nix
  ];
}
